In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.3'

## Data Frames

In [11]:
data = {
    'State' : ['New York','Montreal','Vancouver','Texas','California','San Fransisco'],
    'Population' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.0],
    'Year' : [2000, 2001, 2002, 2001, 2002, 2003]
}

In [12]:
frame = pd.DataFrame(data)
frame

           State  Population  Year
0       New York         1.5  2000
1       Montreal         1.7  2001
2      Vancouver         3.6  2002
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

### Head and Tail Methods

In [13]:
frame.head()

        State  Population  Year
0    New York         1.5  2000
1    Montreal         1.7  2001
2   Vancouver         3.6  2002
3       Texas         2.4  2001
4  California         2.9  2002

In [14]:
frame.tail()

           State  Population  Year
1       Montreal         1.7  2001
2      Vancouver         3.6  2002
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

In [15]:
frame.head(3)

       State  Population  Year
0   New York         1.5  2000
1   Montreal         1.7  2001
2  Vancouver         3.6  2002

In [20]:
frame.tail(3)

           State  Population  Year
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

### Inserting a new column will contain null values

In [22]:
frame2 = pd.DataFrame(data,columns=['Year','State','Population','Tax'],index=[1,2,3,4,5,6])

In [23]:
frame2

   Year          State  Population  Tax
1  2000       New York         1.5  NaN
2  2001       Montreal         1.7  NaN
3  2002      Vancouver         3.6  NaN
4  2001          Texas         2.4  NaN
5  2002     California         2.9  NaN
6  2003  San Fransisco         3.0  NaN

In [25]:
frame2.columns

Index(['Year', 'State', 'Population', 'Tax'], dtype='object')

In [26]:
frame2['State']

1         New York
2         Montreal
3        Vancouver
4            Texas
5       California
6    San Fransisco
Name: State, dtype: object

In [27]:
frame2['Tax']

1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
Name: Tax, dtype: object

In [28]:
frame2['Population']

1    1.5
2    1.7
3    3.6
4    2.4
5    2.9
6    3.0
Name: Population, dtype: float64

In [29]:
frame2.Year

1    2000
2    2001
3    2002
4    2001
5    2002
6    2003
Name: Year, dtype: int64

In [31]:
frame2.loc[3]

Year               2002
State         Vancouver
Population          3.6
Tax                 NaN
Name: 3, dtype: object

In [32]:
frame2.loc[6]

Year                   2003
State         San Fransisco
Population                3
Tax                     NaN
Name: 6, dtype: object

In [33]:
frame2.loc[2]

Year              2001
State         Montreal
Population         1.7
Tax                NaN
Name: 2, dtype: object

In [35]:
frame2['Tax'] = 50

In [36]:
frame2

   Year          State  Population  Tax
1  2000       New York         1.5   50
2  2001       Montreal         1.7   50
3  2002      Vancouver         3.6   50
4  2001          Texas         2.4   50
5  2002     California         2.9   50
6  2003  San Fransisco         3.0   50

In [38]:
frame2['Tax'] = [36,55,86,74,88,45]

In [39]:
frame2

   Year          State  Population  Tax
1  2000       New York         1.5   36
2  2001       Montreal         1.7   55
3  2002      Vancouver         3.6   86
4  2001          Texas         2.4   74
5  2002     California         2.9   88
6  2003  San Fransisco         3.0   45

In [40]:
val = pd.Series([46,65,78],index=[2,4,6])
val

2    46
4    65
6    78
dtype: int64

In [41]:
frame2['Tax'] = val

In [42]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

### Simplest way to add a new column

In [50]:
frame2['GDP'] = frame2.State == 'Vancouver'

In [51]:
frame2

   Year          State  Population   Tax    GDP
1  2000       New York         1.5   NaN  False
2  2001       Montreal         1.7  46.0  False
3  2002      Vancouver         3.6   NaN   True
4  2001          Texas         2.4  65.0  False
5  2002     California         2.9   NaN  False
6  2003  San Fransisco         3.0  78.0  False

### Deleting or Removing a Column

In [ ]:
de